export const General = {
  Q1: `1. ถ้าเกิดมีคนมาบอกว่างานของน้องมัน "ไม่ได้เรื่อง" น้องจะทำยังไง จงอธิบาย`,
  Q2: `2. ให้น้องเลือก 6 คำ แต่งเรื่องราวอะไรก็ได้จากคำเหล่านั้น โดยไม่จำกัดรูปแบบการเขียน : รถเมล์ ถุงยาง ไดโนเสาร์ ตะวันออกกลาง อนาคต ลอร์ดโวลเดอร์มอล ฟ้ารักพ่อ อาจารย์ คนเดียว ก็มาดิค้าบ หนูรัตน์`,
  Q3: `3. หากน้องได้เป็นผู้อำนวยการโรงเรียนปัจจุบันของน้อง แล้วน้องสามารถเปลี่ยนแปลงอะไรก็ได้ในโรงเรียน น้องจะเปลี่ยนแปลงอะไรก่อน? และใช้เครื่องมืออะไรเปลี่ยนแปลง? พร้อมเหตุผล`
};

export const Design = {
  Q1: `1. สมมติว่าน้องได้รับมอบหมายจากผู้อำนวยการโรงเรียน ให้ทำเว็บไซต์สำหรับประชาสัมพันธ์โครงการภาควิชาการเวทมนตร์เป็นที่แรกในประเทศไทย​ แต่เนื่องจากเว็บนี้ไม่เคยมีก่อนเลย น้องคิดว่าอะไรเป็นสิ่งที่ควรจะมีบนหน้าเว็บ และจะมีหน้าตาแสดงผลอย่างไร เพราะอะไร?`,
  Q2: `2. ในปัจจุบันมีเว็บไซต์สำหรับซื้อสินค้าออนไลน์อยู่มากมาย เช่น Shopee, Lazada, AliExpress ในมุมมองน้อง คิดว่าการออกแบบของเว็บซื้อสินค้าออนไลน์ใดที่ทำให้น้องรู้สึกสนใจอยากซื้อสินค้ามากที่สุด เพราะอะไร`,
  Q3: `3. เพื่อเตรียมตัวสู่การเป็นนักเรียนในโลกเวทมนตร์ น้องได้รับอนุญาติให้นำสิ่งของวิเศษพกติดตัวไปได้หนึ่งอย่าง อยากให้น้องลองออกแบบหน้าตา ด้วยวิธีการใดก็ได้ ขึ้นมาพร้อมทั้งเขียนสรรพคุณให้พี่ๆ เข้าใจ โดยส่งเป็นไฟล์ภาพขึ้นมา 1 ภาพ`,
  Q4: `4. ภาพประกอบข้อ 3`
};

export const Programming = {
  Q1: `1. ในสายตาของน้องๆที่กำลังจะมาเป็นนักเวทย์ฝึกหัด น้องๆคงจะเห็นเว็บไซต์จากเหล่าจอมเวทย์มานับไม่ถ้วน จากเว็บเหล่านั้น ให้น้องเลือกมา 1 เว็บไซต์ที่น้องๆ ชื่นชอบมากที่สุด พร้อมบอกเหตุผลประกอบ`,
  Q2: `2. ในฐานะที่เจ้าจะมาเป็นเป็นจอมเวทย์ฝึกหัด สิ่งที่ขาดไปไม่ได้เลยสำหรับเหล่าจอมเวทย์อย่างพวกเราคือ เหล่าบริวารรับใช้ที่ซื่อสัตย์จำนวนทั้งสิ้น 9 ตนด้วยกัน แต่เคราะห์ร้ายระหว่างร่ายคาถาเกิดเหตุไม่คาดฝันเกิดขึ้น วงเวทย์อัญเชิญของพวกเจ้าทำให้มีผีร้ายปะปนมากับเหล่าบริวารของเจ้าจำนวน 2 ตน ทำให้พวกเจ้าต้องจัดการเหล่าผีร้ายให้สิ้นไป เคราะห์ดีที่พวกเจ้ามีตาวิเศษ ทำให้เห็นเลขอายุขัยของเหล่าบริวารของเจ้าได้ ซึ่งบริวารที่แท้จริงของเจ้าทั้ง 9 จะมีอายุขัยรวมกันเท่ากับ 100 ปี พวกเจ้าจงหาวิธีที่จะกำจัดเหล่าผีร้ายทั้งหมดให้ได้ (พร้อมอธิบายอย่างละเอียด และรับประกันว่าจะมีแค่เลขชุดเดียวจำนวน 9 ตัว ที่เป็นไปได้ในเลข 11 ตัว ที่มีผลรวมเท่ากับ 100 และเลขทุกตัวไม่ซ้ำกัน)`,
  Q3: `3. ให้น้องๆ สร้างสรรค์เว็บขึ้นมาตามภาพ โดยจะใช้เทคนิคอะไร ภาษาอะไร เติมแต่งอะไรได้เต็มที่! โดยส่งได้ทั้งวิธีคัดลอกโค้ดมาวาง, วางลิงก์ Google drive หรืออัพลง Public Repository เช่น GitHub แล้วแปะลิ้งก์ไว้`,
  Q4: `4. หรือน้องๆ ที่มีผลงานเก่าๆ สามารถส่งเว็บไซต์ที่น้องๆ เคยทำมาก่อน แทนการทำข้อ 3.1 โดยส่งเป็น ZIP อัพลง Public Repositoy หรือ URL ของเว็บไซต์ ที่น้องๆ ทำมาได้`
};

export const Content = {
  Q1: `1. ถ้าน้องๆ สามารถขอพรพิเศษได้ 1 อย่าง พรที่น้องจะขอนั้นคือพรอะไร และน้องจะนำพรนั้นไปใช้งานอย่างไรบ้าง ลองเล่ามาให้พี่ๆ ฟังหน่อย`,
  Q2: `2. สมมติว่าน้องๆ ได้เป็นผู้นำแห่งเมืองเวทมนตร์ JWC แล้วต้องคิด 1 นโยบายเพื่อพัฒนาชาวเมือง นโยบายของน้องจะเป็นอย่างไร บอกรายละเอียดโดยสังเขป และเล่าว่าจะสื่อสารอย่างไรให้ชาวเมืองเห็นด้วย`,
  Q3: `3. ปัญหาฝุ่นละอองขนาดเล็ก PM2.5 เป็นปัญหาด้านสุขภาพที่คนจำนวนมากต้องเผชิญ มีข้อมูลมากมายออกมาเกี่ยวกับเรื่องนี้ พี่ๆ เลยอยากให้สรุปเรื่องเกี่ยวกับ PM2.5 ในรูปแบบใดก็ได้ให้พี่ๆ เข้าใจ (ไม่เกิน 1,000 ตัวอักษร)`
};

export const Marketing = {
  Q1: `1. ในรอบ 5 ปีที่ผ่านมา น้องๆ คิดว่า “การเรียนพิเศษ” มีการเปลี่ยนแปลงไปอย่างไรบ้าง แล้วอนาคตจะมีแนวโน้มพัฒนาขึ้นอย่างไร ในด้านของตัวสินค้า ราคา โปรโมชั่น และแหล่งที่จำหน่ายสินค้า โดยให้เหตุผลและยกตัวอย่างประกอบ`,
  Q2: `2. สมมติว่าวันหนึ่ง Elon Musk สามารถนำคนไปอยู่ในโลกเวทมนตร์ได้ ให้น้องคิดสินค้าหรือบริการขึ้นมา 1 อย่าง ที่ตอบกลุ่มเป้าหมายในโลกเวทมนตร์ พร้อมอธิบายเหตุผลที่ทุกคนต้องซื้อสินค้าจากน้อง`,
  Q3: `3. จากข้อ 2 น้องๆ จะโปรโมตสินค้าหรือบริการที่น้องคิด ผ่านช่องทาง Social Media ใดบ้าง พร้อมเล่าเหตุผล (โลกเวทมนตร์สามารถใช้ Social Media ได้เหมือนโลกของพวกเรานะ)`,
};

export default {
  general: General,
  design: Design,
  programming: Programming,
  content: Content,
  marketing: Marketing
};
