export const General = {
  Q1: `1. ถ้าเกิดมีคนมาบอกว่างานของน้องมัน "ไม่ได้เรื่อง" น้องจะทำยังไง จงอธิบาย`,
  Q2: `2. ให้น้องเลือก 6 คำด้านล่าง แต่งเรื่องราวอะไรก็ได้จากคำเหล่านั้น โดยไม่จำกัดรูปแบบการเขียน : รถเมล์ ถุงยาง ไดโนเสาร์ ตะวันออกกลาง อนาคต ลอร์ดโวลเดอร์มอล ฟ้ารักพ่อ อาจารย์ คนเดียว ก็มาดิค้าบ หนูรัตน์`,
  Q3: `3. หากน้องได้เป็นผู้อำนวยการโรงเรียนปัจจุบันของน้อง แล้วน้องสามารถเปลี่ยนแปลงอะไรก็ได้ในโรงเรียน น้องจะเปลี่ยนแปลงอะไรก่อน? และใช้เครื่องมืออะไรเปลี่ยนแปลง? พร้อมเหตุผล`
};

export const Design = {
  Q1: `1. สมมติว่าน้องได้รับมอบหมายจากผู้อำนวยการโรงเรียน ให้ทำเว็บไซต์สำหรับประชาสัมพันธ์โครงการภาควิชาการเวทมนตร์เป็นที่แรกในประเทศไทย​ แต่เนื่องจากเว็บนี้ไม่เคยมีก่อนเลย น้องคิดว่าอะไรเป็นสิ่งที่ควรจะมีบนหน้าเว็บ และจะมีหน้าตาแสดงผลอย่างไร เพราะอะไร?`,
  Q2: `2. ในปัจจุบันมีเว็บไซต์สำหรับซื้อสินค้าออนไลน์อยู่มากมาย เช่น Shopee, Lazada, AliExpress ในมุมมองน้อง คิดว่าการออกแบบของเว็บซื้อสินค้าออนไลน์ใดที่ทำให้น้องรู้สึกสนใจอยากซื้อสินค้ามากที่สุด เพราะอะไร`,
  Q3: `3. เพื่อเตรียมตัวสู่การเป็นนักเรียนในโลกเวทมนตร์ น้องได้รับอนุญาติให้นำสิ่งของวิเศษพกติดตัวไปได้หนึ่งอย่าง อยากให้น้องลองออกแบบหน้าตา ด้วยวิธีการใดก็ได้ ขึ้นมาพร้อมทั้งเขียนสรรพคุณให้พี่ๆ เข้าใจ โดยส่งเป็นไฟล์ภาพขึ้นมา 1 ภาพ`,
  Q4: `4. ภาพประกอบข้อ 3`
};

export const Programming = {
  Q1: `1. ในสายตาของน้องๆที่กำลังจะมาเป็นนักเวทย์ฝึกหัด น้องๆคงจะเห็นเว็บไซต์จากเหล่าจอมเวทย์มานับไม่ถ้วน จากเว็บเหล่านั้น ให้น้องเลือกมา 1 เว็บไซต์ที่น้องๆ ชื่นชอบมากที่สุด พร้อมบอกเหตุผลประกอบ`,
  Q2: `2. สำหรับน้องๆ ที่กำลังจะมาศึกษาการเป็น Web Programmer น้องๆ คิดว่าในอนาคต สิ่งที่จำเป็น สำหรับการเป็น Web Programmer คืออะไร? พร้อมคำอธิบาย`,
  Q3: `3. ให้น้องๆ สร้างสรรค์เว็บขึ้นมาตามภาพด้านล่าง โดยจะใช้เทคนิคอะไร ภาษาอะไร เติมแต่งอะไรได้เต็มที่! โดยส่งได้ทั้งวิธีคัดลอกโค้ดมาวาง อัพไฟล์ Zip หรืออัพลง Public Repository เช่น GitHub แล้วแปะลิ้งก์ไว้`
};

export const Content = {
  Q1: `1. ถ้าน้องๆ สามารถขอพรพิเศษได้ 1 อย่าง พรที่น้องจะขอนั้นคือพรอะไร และน้องจะนำพรนั้นไปใช้งานอย่างไรบ้าง ลองเล่ามาให้พี่ๆ ฟังหน่อย`,
  Q2: `2. สมมติว่าน้องๆ ได้เป็นผู้นำแห่งเมืองเวทมนตร์ JWC แล้วต้องคิด 1 นโยบายเพื่อพัฒนาชาวเมือง นโยบายของน้องจะเป็นอย่างไร บอกรายละเอียดโดยสังเขป และเล่าว่าจะสื่อสารอย่างไรให้ชาวเมืองเห็นด้วย`,
  Q3: `3. มีข้อมูลมากมายออกมาเกี่ยวกับปัญหาเรื่อง PM2.5 ที่น้องๆ ก็คงเผชิญมา พี่เลยอยากให้น้องๆ ลองสรุปเรื่องเกี่ยวกับ PM2.5 ในรูปแบบใดก็ได้ให้พี่ๆ เข้าใจ (ไม่เกิน 1,000 ตัวอักษร)`
};

export const Marketing = {
  Q1: `1. ในรอบ 5 ปีที่ผ่านมา น้อง ๆ คิดว่า "การเรียนพิเศษ" มีการเปลี่ยนแปลงไปอย่างไรบ้าง และอนาคตจะมีแนวโน้มพัฒนาขึ้นอย่างไรบ้าง โดยอ้างอิงหลักการตลาด 4P พร้อมยกตัวอย่างประกอบ`,
  Q2: `2. สมมติว่าวันหนึ่ง Elon Musk สามารถนำคนไปอยู่ในโลกเวทมนตร์ได้ ให้น้องคิดสินค้าหรือบริการขึ้นมา 1 อย่าง ที่ตอบกลุ่มเป้าหมายในโลกเวทมนตร์ พร้อมอธิบายเหตุผลที่ทุกคนต้องซื้อสินค้าจากน้อง`,
  Q3: `3. จากข้อ 2 น้องๆ จะโปรโมตสินค้าหรือบริการที่น้องคิด ผ่านช่องทาง Social Media ใดบ้าง พร้อมเล่าเหตุผล (โลกเวทมนตร์สามารถใช้ Social Media ได้เหมือนโลกของพวกเรานะ)`,
};

export default {
  general: General,
  design: Design,
  programming: Programming,
  content: Content,
  marketing: Marketing
};
