export const General = {
  Q1: `1. ถ้าเกิดมีคนมาบอกว่างานของน้องมัน "ไม่ได้เรื่อง" น้องจะทำยังไง จงอธิบาย`,
  Q2: `2. ให้น้องเลือก 6 คำ แต่งเรื่องราวอะไรก็ได้จากคำเหล่านั้น โดยไม่จำกัดรูปแบบการเขียน : รถเมล์ ถุงยาง ไดโนเสาร์ ตะวันออกกลาง อนาคต ลอร์ดโวลเดอร์มอล ฟ้ารักพ่อ อาจารย์ คนเดียว ก็มาดิค้าบ หนูรัตน์`,
  Q3: `3. หากน้องได้เป็นผู้อำนวยการโรงเรียนปัจจุบันของน้อง แล้วน้องสามารถเปลี่ยนแปลงอะไรก็ได้ในโรงเรียน น้องจะเปลี่ยนแปลงอะไรก่อน? และใช้เครื่องมืออะไรเปลี่ยนแปลง? พร้อมเหตุผล`
};

export const Design = {
  Q1: `1. สมมติว่าน้องได้รับมอบหมายจากผอ.โรงเรียน ให้ทำเว็บไซต์สำหรับประชาสัมพันธ์โครงการภาควิชาการเวทมนตร์เป็นที่แรกในประเทศไทย​ แต่เนื่องจากเว็บนี้ไม่เคยมีก่อนเลย น้องคิดว่าอะไรเป็นสิ่งที่ควรจะมีบนหน้าเว็บ และมีการแสดงผลอย่างไร เพราะเหตุใด`,
  Q2: `2. ในปัจจุบันมีเว็บไซต์สำหรับซื้อสินค้าออนไลน์อยู่มากมาย เช่น Shopee, Lazada, AliExpress ในมุมมองของนักออกแบบ น้องคิดว่าการออกแบบของเว็บซื้อสินค้าออนไลน์ใดที่ทำให้น้องรู้สึกสนใจอยากซื้อสินค้ามากที่สุด เพราะเหตุใด`,
  Q3: `3. เพื่อเตรียมตัวสู่การเป็นนักเรียนในโลกเวทมนตร์ น้องได้รับอนุญาติให้นำสิ่งของวิเศษพกติดตัวไปได้หนึ่งอย่าง อยากให้น้องลองออกแบบหน้าตาขึ้นมาพร้อมทั้งเขียนบรรยายสรรพคุณให้พี่ๆ เข้าใจ`,
  Q4: `4. ภาพประกอบข้อ 3`
};

export const Programming = {
  Q1: `1. กาลครั้งหนึ่ง มีฤาษีอายุมากเจอกับหนุ่มน้อยในป่าลึก ฤาษีบอกหนุ่มน้อยคนนั้นว่า "เจ้าเคยเจอแม่มดไหม" หนุ่มน้อยตอบทันควันว่า "ไม่เคยเลยครับ พวกเขาเป็นคนอย่างไรกันหรือ?" ฤาษีเล่าว่า "ในป่านี้ มีแม่มด แม่มดบางคนเป็นคนฉลาด แม่มดบางคนเป็นคนโหดเหี้ยม และแม่มดที่โหดเหี้ยมทุกคนเป็นคนฉลาด" หนุ่มน้อยจึงถามกลับไปว่า "แล้วแม่มดที่ฉลาดโหดเหี้ยมหรือเปล่า?" อยากให้น้องๆ ให้คำตอบหนุ่มน้อยพร้อมคำอธิบาย`,
  Q2: `2. ในฐานะที่เจ้าจะมาเป็นเป็นจอมเวทย์ฝึกหัด สิ่งที่ขาดไปไม่ได้เลยสำหรับเหล่าจอมเวทย์อย่างพวกเราคือ เหล่าบริวารรับใช้ที่ซื่อสัตย์จำนวนทั้งสิ้น 9 ตนด้วยกัน แต่เคราะห์ร้ายระหว่างร่ายคาถาเกิดเหตุไม่คาดฝันเกิดขึ้น วงเวทย์อัญเชิญของพวกเจ้าทำให้มีผีร้ายปะปนมากับเหล่าบริวารของเจ้าจำนวน 2 ตน ทำให้พวกเจ้าต้องจัดการเหล่าผีร้ายให้สิ้นไป เคราะห์ดีที่พวกเจ้ามีตาวิเศษ ทำให้เห็นเลขอายุขัยของเหล่าบริวารของเจ้าได้ ซึ่งบริวารที่แท้จริงของเจ้าทั้ง 9 จะมีอายุขัยรวมกันเท่ากับ 100 ปี พวกเจ้าจงหาวิธีที่จะกำจัดเหล่าผีร้ายทั้งหมดให้ได้ (พร้อมอธิบายอย่างละเอียด และรับประกันว่าจะมีแค่เลขชุดเดียวจำนวน 9 ตัว ที่เป็นไปได้ในเลข 11 ตัว ที่มีผลรวมเท่ากับ 100 และเลขทุกตัวไม่ซ้ำกัน)`,
  Q3: `3. ให้น้องๆ สร้างสรรค์เว็บขึ้นมาตามภาพด้านบน โดยจะใช้เทคนิคอะไร ภาษาอะไร เติมแต่งอะไรได้เต็มที่! โดยส่งได้ทั้งวิธีคัดลอกโค้ดมาวาง, วางลิงก์ Google drive หรืออัพลง Public Repository เช่น GitHub แล้วแปะลิ้งก์ไว้`
};

export const Content = {
  Q1: `1. ให้น้องแก้คำผิดในข้อความด้านล่างให้ถูกต้อง รวมถึงเว้นวรรคให้อ่านง่าย
  "สวัสดีคร่พี่เป็นตัวแทนจากค่ายเจดับบลิวซี11นะคร๊ายินดีที่ได้รู้จักกับน้องๆทุกคนค่ะ รู้ไหมค่ะว่าบ้านพี่อยู่แจ้งวัฒนะค่ะตอนนี้น้องๆพร้อมกรอกใบสมัครกันแล้วใช่ไหมค่ะงั้นให้น้องๆแก้คำผิดในย่อหน้านี้ให้ถูกต้องและเว้นวรรคให้อ่านง่ายกันดีกว่าคะถ้าพร้อมแล้วก็แก้กันได้เลยคร่ะ"
  `,
  Q2: `2. ถ้าเกิดวันหนึ่งน้องต้องคิดคอนเทนต์เพื่อนำเสนอแก่พรรคการเมืองหน้าใหม่ โดยนำนโยบายของพรรคในเรื่องดังต่อไปนี้ 
- ยกเลิกทรงผมนักเรียน
- ขนมจีบยังชีพทุกสิ้นเดือน
- จัดเก็บภาษีเพิ่มเติม 20%
- สร้างรถไฟเหาะรอบเมือง
โดยให้น้องเลือก 1 ข้อมานำเสนอให้เป็นที่สนใจและให้ประชาชนตัดสินใจเลือกพรรคนี้มากที่สุด น้องจะทำคอนเทนต์ในรูปแบบไหน มีเนื้อหาประมาณไหน เพราะอะไร? อธิบายให้เข้าใจ`,
  Q3: `3. ปัญหาฝุ่นละอองขนาดเล็ก PM2.5 เป็นปัญหาด้านสุขภาพที่คนจำนวนมากต้องเผชิญ มีข้อมูลมากมายออกมาเกี่ยวกับเรื่องนี้ พี่ๆ เลยอยากให้สรุปเรื่องเกี่ยวกับ PM2.5 ในรูปแบบใดก็ได้ให้พี่ๆ เข้าใจ (ไม่เกิน 1,000 ตัวอักษร)`
};

export const Marketing = {
  Q1: `1. ในรอบ 5 ปีที่ผ่านมา น้อง ๆ คิดว่า "การเรียนพิเศษ" มีการเปลี่ยนแปลงไปอย่างไรบ้าง และอนาคตจะมีแนวโน้มพัฒนาขึ้นอย่างไรบ้าง โดยอ้างอิงหลักการตลาด 4P พร้อมยกตัวอย่างประกอบ`,
  Q2: `2. หากว่าวันนึง Elon Musk สามารถนำคนไปอยู่ในโลกเวทมนตร์ได้ น้องคิดสินค้าหรือบริการขึ้นมา 1 อย่าง ที่ตอบกลุ่มเป้าหมายในโลกเวทมนตร์ พร้อมอธิบายเหตุผลที่ทุกคนต้องซื้อสินค้าจากน้องโดยละเอียด`,
  Q3: `3. จากข้อ 2 สินค้าหรือบริการของน้องจะโปรโมทผ่านช่องทาง Social Media ใดบ้าง เพราะอะไร? (โลกเวทมนตร์สามารถใช้ Social Media ได้ทุกประเภท) `,
  Q4: `4. สมมุติว่าน้องกลายเป็นนักการตลาด ให้น้องอธิบายสิ่งที่ควรให้ความสำคัญในการดำเนินธุรกิจ มาอย่างน้อย 5 ข้อ อธิบาย ยกตัวอย่าง และเรียงลำดับความสำคัญตามความคิดเห็นของน้อง`,
  Q5: `5. (คำถามข้อนี้ไม่มีคะแนนแต่จะทำให้พวกพี่รู้จักน้องมากยิ่งขึ้น) น้องๆติดตามข้อมูลข่าวสาร Marketing มาจากแหล่งไหนบ้าง อาทิ หนังสือ เพจ Podcast กิจกรรม หรือ อื่นๆ พร้อมแบ่งปันสิ่งที่ประทับใจ `
};

export default {
  general: General,
  design: Design,
  programming: Programming,
  content: Content,
  marketing: Marketing
};
