export const General = {
  Q1: `1. สมมุติว่าน้องเป็นนักเวทย์มนต์แห่งการท่องกาลเวลา สามารถย้อนเวลากลับไปในอดีตและเดินทางไปยังโลกอนาคตได้ น้องจะใช้ความสามารถนี้ในการแก้ปัญหาด้านความเหลื่อมล้ำทางการศึกษาไทยที่เกิดขึ้นในปัจจุบันได้อย่างไร`
}

export const Design = {
  Q1: `2. ลองออกแบบเว็บ แอพพลิเคชั่น หรือสินค้าใดๆ ขึ้นมา เพื่อช่วยให้ขอทานสามารถรับบริจาคเงินได้มากขึ้น เช่น กล่องรับบริจาครูปแบบใหม่ เป็นต้น`,
  Q2: `3. จากคำถามข้อที่ 2 เล่าให้พวกเราฟังหน่อยว่าปัญหาที่น้องๆ พบคืออะไร เลือกที่จะแก้ปัญหาอย่างไร และทำไมถึงเลือกที่จะออกแบบสิ่งประดิษฐ์ดังกล่าว`
}

export const Programming = {
  Q1: `2. ลองออกแบบระบบที่น้องๆ คิดว่าสามารถช่วยให้การเดินทางด้วยระบบขนส่งสาธารณะดียิ่งขึ้น ไม่ว่าจะเป็น แท็กซี่ รถเมล์ รถไฟฟ้า รถไฟ หรือเครื่องบิน และจะใช้เทคโนโลยีอะไรในการแก้ปัญหานี้ได้บ้าง`,
  Q2: `3. ลองเขียนโปรแกรมเพื่อแนะนำตัวเองสั้นๆ ในรูปแบบใดๆ ก็ได้ ไม่ว่าจะเป็นเว็บไซต์, โปรแกรม command line หรือรูปแบบอื่นๆ ตามที่ต้องการ

  (ถ้าเป็นโค้ด HTML สามารถวางในช่องด้านล่างได้เลย หรือสามารถส่งโค้ดมาผ่าน GitHub, Gist หรือแพลตฟอร์มอื่นๆ ได้ตามต้องการ)`
}

export default {
  general: General,
  design: Design,
  programming: Programming
}
